# вариант 17
# Дана строка. Преобразовать в ней все строчные буквы (как латинские, так и русские) в прописные.

s = input("Введите строку: ")
print("Переводим строчные буквы в прописные: ", s.upper())      # upper - переводит буквы в верхний регистр
